In [1]:
import pandas as pd

In [7]:
# Load dataset
df = pd.read_csv('CrimesOnWomenData.csv')
data_desc = pd.read_csv('description.csv')

In [8]:
df.head(5)

   Unnamed: 0              State  Year  Rape   K&A   DD   AoW   AoM    DV  WT
0           0     ANDHRA PRADESH  2001   871   765  420  3544  2271  5791   7
1           1  ARUNACHAL PRADESH  2001    33    55    0    78     3    11   0
2           2              ASSAM  2001   817  1070   59   850     4  1248   0
3           3              BIHAR  2001   888   518  859   562    21  1558  83
4           4       CHHATTISGARH  2001   959   171   70  1763   161   840   0

In [9]:
data_desc

   Unnamed: 0 Column Names                       Explanation
0           0        State                             State
1           1         Year                              Year
2           2         Rape                 No. of Rape cases
3           3          K&A                Kidnap And Assault
4           4           DD                      Dowry Deaths
5           5          AoW             Assault against women
6           6          AoM  Assault against modesty of women
7           7           DV                 Domestic violence
8           8           WT                 Women Trafficking

In [10]:
df.drop(columns='Unnamed: 0', inplace=True)

In [11]:
df.head(2)

               State  Year  Rape  K&A   DD   AoW   AoM    DV  WT
0     ANDHRA PRADESH  2001   871  765  420  3544  2271  5791   7
1  ARUNACHAL PRADESH  2001    33   55    0    78     3    11   0

In [12]:
df.describe()

,Year,Rape,K&A,DD,AoW,AoM,DV,WT
count,736.000000,736.000000,736.000000,736.000000,736.000000,736.000000,736.000000,736.000000
mean,2011.149457,727.855978,1134.542120,215.692935,1579.115489,332.722826,2595.078804,28.744565
std,6.053453,977.024945,1993.536828,424.927334,2463.962518,806.024551,4042.004953,79.999660
min,2001.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2006.000000,35.000000,24.750000,1.000000,34.000000,3.000000,13.000000,0.000000
50%,2011.000000,348.500000,290.000000,29.000000,387.500000,31.000000,678.500000,0.000000
75%,2016.000000,1069.000000,1216.000000,259.000000,2122.250000,277.500000,3545.000000,15.000000
max,2021.000000,6337.000000,15381.000000,2524.000000,14853.000000,9422.000000,23278.000000,549.000000